<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'name-required'             => 'សូមបញ្ជូលឈ្មោះរបស់នាក់',
    'phone-unique'              => 'ទូរស័ព្ទនេះត្រូវបានគេយករួចហើយ។ សូមជ្រើសរើសមួយផ្សេងទៀត។',
    'phone-required'            => 'សូមបញ្ចូលលេខទូរស័ព្ទរបស់អ្នក',
    'phone-regex'               => 'សូមប្រើទម្រង់លេខទូរស័ព្ទត្រឹមត្រូវ។ E.g 0965416704',
    'email-required'            => 'សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលត្រឹមត្រូវ',
    'email-email'               => 'សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលត្រឹមត្រូវ. E.g khouch.koeun@gmail.com',
    'email-max'                 => 'អាសយដ្ឋានអ៊ីម៉ែលរបស់អ្នកត្រូវមានប្រវែងអតិបរមា 50 តួលេខ',
    'email-unique'              => 'អ៊ីម៉ែលត្រូវបានគេយករួចហើយ។ សូមជ្រើសរើសមួយផ្សេងទៀត។',
    'password-required'         => 'សូម​បញ្ចូល​ពាក្យ​សម្ងាត់​របស់​អ្នក',
    'password-min'              => 'ពាក្យសំងាត់ត្រូវមានចំនួន ៦ខ្ទង់យ៉ាងហោចណាស់',
    'password-max'              => 'ពាក្យសំងាត់ត្រូវមានចំនួន ៦០ខ្ទង់យ៉ាងច្រើនបំផុត',
    'password-confirmed'        => 'សូមបញ្ជាក់ពាក្យសម្ងាត់របស់អ្នក',
    'notification'              => 'សូមស្វាគមន៍សមាជិកថ្មី',
    'notification-message'      => 'គណនីរបស់អ្នកត្រូវបានបង្កើតដោយជោគជ័យ។ សូមពិនិត្យអ៊ីម៉ែលរបស់អ្នកសម្រាប់លេខកូដផ្ទៀងផ្ទាត់គណនី។',
    'nexmo-message'             => 'គណនីរបស់អ្នកត្រូវបានបង្កើតដោយជោគជ័យ។ សូមពិនិត្យទូរស័ព្ទរបស់អ្នកសម្រាប់លេខកូដផ្ទៀងផ្ទាត់គណនី',
    'register-success'          => 'គណនីរបស់អ្នកត្រូវបានបង្កើតដោយជោគជ័យ។',

    'social-id-unique'          => 'អ្នកមានគណនីរួចហើយ។ សូមចូលជាមួយគណនីសង្គមរបស់អ្នក។',
    'social-id-type'            => 'សូមបញ្ជាក់ពីប្រភេទសង្គមរបស់អ្នក។',

];
